# TabSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..TabSize Property
TextNode Class See Also
---
The size [ft] of the interval between tab stops, in model space.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double TabSize { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TabSize As Double
	Get
```

Visual C++
---
```text
public:
property double TabSize {
	double get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace